tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"

brew "ansible"
brew "ansible-linter"
brew "bat"
brew "bitwarden-cli"
brew "brotli"
brew "cloc"
brew "colima"
brew "curl"
brew "direnv"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gettext"
brew "gh"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "harfbuzz"
brew "httpie"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "less"
brew "libass"
brew "libmicrohttpd"
brew "libressl"
brew "librist"
brew "lima"
brew "mas"
brew "midnight-commander"
brew "mkcert"
brew "nano"
brew "nmap"
brew "node"
brew "nss"
brew "pango"
brew "pipx"
brew "pstree"
brew "python@3.12"
brew "qemu"
brew "ripgrep"
brew "telnet"
brew "tesseract"
brew "tldr"
brew "tree"
brew "watch"
brew "webp"
brew "wget"
brew "zoxide"
brew "zsh-async"

cask "arc"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "logi-options-plus"
cask "miro"
cask "mjml"
cask "notion"
cask "notion-calendar"
cask "outline-manager"
cask "pika"
cask "raycast"
cask "spotify"
cask "switchhosts"
cask "telegram"
cask "visual-studio-code"
cask "zoom"

mas "Bitwarden", id: 1352778147
mas "Command X", id: 6448461551
mas "Day Progress", id: 6450280202
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Outline", id: 1356178125
mas "Pixelmator", id: 407963104
mas "ReadKit", id: 1615798039
mas "Week Number", id: 6502579523
mas "Xcode", id: 497799835

vscode "adamhartford.vscode-base64"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dqisme.sync-scroll"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.github-vscode-theme"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "netcorext.uuid-generator"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "samuelcolvin.jinjahtml"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "webben.browserslist"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
