tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

# brew "docker-compose"
# brew "docker-machine"
# brew "kubectx"
# brew "kubernetes-cli"
brew "asciinema"
brew "bat"
brew "brotli"
brew "cloc"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gettext"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "glow"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "less"
brew "libressl"
brew "mas"
brew "midnight-commander"
brew "nmap"
brew "node"
brew "pstree"
brew "ripgrep"
brew "telnet"
brew "tldr"
brew "tree"
brew "vegeta"
brew "watch"
brew "webp"
brew "wget"

cask "1password"
cask "charles"
cask "cleanmymac"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "microsoft-edge"
cask "ngrok"
cask "sip"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
