tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "bat"
brew "brotli"
brew "cloc"
brew "colima"
brew "curl"
brew "direnv"
brew "docker"
brew "dog"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gettext"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnupg"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "less"
brew "libressl"
brew "mas"
brew "midnight-commander"
brew "mkcert"
brew "nmap"
brew "node"
brew "nss"
brew "nvm"
brew "pstree"
brew "python@3.11"
brew "ripgrep"
brew "telnet"
brew "tldr"
brew "tree"
brew "watch"
brew "webp"
brew "wget"

cask "font-jetbrains-mono-nerd-font"

mas "Bitwarden", id: 1352778147
mas "Things", id: 904280696

vscode "adamhartford.vscode-base64"
vscode "adpyke.codesnap"
vscode "arcanis.vscode-zipfs"
vscode "ban.spellright"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "netcorext.uuid-generator"
vscode "Prisma.prisma"
vscode "rebornix.project-snippets"
vscode "ryanluker.vscode-coverage-gutters"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "webben.browserslist"
vscode "william-voyek.vscode-nginx"
vscode "yzhang.markdown-all-in-one"
